tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "jesseduffield/lazygit"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Command-line fuzzy finder written in Go
brew "fzf"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Python version management
brew "pyenv"
# CPU/RAM/battery stats chart bar for tmux (and GNU screen)
brew "rainbarf"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Terminal multiplexer
brew "tmux"
# A simple terminal UI for git commands, written in Go
brew "jesseduffield/lazygit/lazygit"
# GPU-accelerated terminal emulator
cask "alacritty"
# Developer targeted fonts with a high number of glyphs
cask "font-blex-mono-nerd-font"
# Snip or pin screenshots
cask "snipaste"
vscode "aaron-bond.better-comments"
vscode "bierner.markdown-preview-github-styles"
vscode "bradlc.vscode-tailwindcss"
vscode "bukas.gbktoutf8"
vscode "byted-cannycoder.cannycoder"
vscode "byted-ide.authenticator"
vscode "byted-ide.cloud-dev-code-analysis"
vscode "byted-ide.cloud-dev-debug"
vscode "byted-ide.cloud-dev-merge-request"
vscode "byted-ide.cloud-dev-task"
vscode "byted-ide.cloud-toolkit"
vscode "byted-ide.gallery"
vscode "byted-sec.bytesec-vscode"
vscode "cduruk.thrift"
vscode "christian-kohler.path-intellisense"
vscode "codezombiech.gitignore"
vscode "dbaeumer.vscode-eslint"
vscode "donjayamanne.githistory"
vscode "dracula-theme.theme-dracula"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "firefox-devtools.vscode-firefox-debug"
vscode "formulahendry.auto-rename-tag"
vscode "golang.go"
vscode "gruntfuggly.todo-tree"
vscode "htmlhint.vscode-htmlhint"
vscode "ionutvmi.path-autocomplete"
vscode "jasonnutter.search-node-modules"
vscode "jock.svg"
vscode "mhutchie.git-graph"
vscode "mikestead.dotenv"
vscode "mrmlnc.vscode-scss"
vscode "ms-ceintl.vscode-language-pack-zh-hans"
vscode "ms-vscode.vscode-typescript-next"
vscode "obkoro1.korofileheader"
vscode "octref.vetur"
vscode "oouo-diogo-perdigao.docthis"
vscode "oysun.vuehelper"
vscode "sjhuangx.vscode-scheme"
vscode "streetsidesoftware.code-spell-checker"
vscode "styled-components.vscode-styled-components"
vscode "sysoev.language-stylus"
vscode "tabnine.tabnine-vscode"
vscode "vscode-icons-team.vscode-icons"
vscode "vscodevim.vim"
vscode "wayou.vscode-todo-highlight"
vscode "xabikos.reactsnippets"
vscode "yzhang.markdown-all-in-one"
